<div class="center">
	<img src="./img/my_img.png">
		<div class="box_text">
			<p><b>Добрый день</b>. Меня зовут <i>Шорохов Алексей</i>. я записался на факультет по java-Программированию 
			и на IT-портале <a href="https://geekbrains.ru"><b>GeekBrains</b></a>.</p>
			
			<p>В данный момент прохожу подготовительные курсы перед началом основного обучения,
			в котором пока больше времени тратилось на проверку домашних работать других учащихся, 
			пока не столкулся с написание этого сайта.</p>
			<p>Не хотел что бы мне попалось PHP, но оно попалось, что делать, придется мучаться...</p>
			
			<p>По мере возможности буду выкладывать сюда свои работы, и для себя и для других.</p>
		</div>
</div>