/*
+5. Создать классы Собака и Кот с наследованием от класса Животное;
+6. Животные могут выполнять действия: бежать, плыть, перепрыгивать препятствие. В качестве параметра каждому методу передается величина, означающая или длину препятствия (для бега и плавания), или высоту (для прыжков);
7. У каждого животного есть ограничения на действия (бег: кот – 200 м., собака – 500 м.; прыжок: кот – 2 м., собака – 0.5 м.; плавание: кот не умеет плавать, собака – 10 м.);
+8. При попытке животного выполнить одно из этих действий, оно должно сообщить результат в консоль. (Например, dog1.run(150); -> результат: run: true);
9. * Добавить животным разброс в ограничениях. То есть у одной собаки ограничение на бег может быть 400 м., у другой – 600 м.
 */

public class Cat extends Animal{

    public Cat(String _name){
        super(_name, 200, 2, 0);
    }

    public Cat(String _name, double _maxRunLength){
        super(_name, _maxRunLength, 2, 0);
    }

    public Cat(String _name, double _maxRunLength, double _maxJumpHeight, double _maxSwimLength){
        super(_name, _maxRunLength, _maxJumpHeight, _maxSwimLength);
    }

}
