package Xokyopo.hw_1;

/*
1. Разобраться с имеющимся кодом;
2. Добавить класс Team, который будет содержать название команды, массив из четырех участников (в конструкторе можно сразу указыватьвсех участников ),
метод для вывода информации о членах команды, прошедших дистанцию, метод вывода информации обо всех членах команды.
3. Добавить класс Course (полоса препятствий), в котором будут находиться массив препятствий и метод, который будет просить команду пройти всю полосу;
В итоге должно быть что-то вроде:

public static void main(String[] args) {
Course c = new Course(...); // Создаем полосу препятствий
Team team = new Team(...); // Создаем команду
c.doIt(team); // Просим команду пройти полосу
team.showResults(); // Показываем результаты
}
 */

public class Main {

    public static void main(String[] args) {
        //создаем экземпляр класса соревнований. все настройки в нем, кроме настройки снятия с дистанции
        Contest contest = new Contest(true);
        contest.starContest();
	// write your code here
    }
}
